/*
 *В методе main объявить две переменные.
 *Первую переменную объявить типом char и присвоить значение 1, вторую переменную объявить типом int и присвоить занчение 1.
 *Вывести на консоль результат первая переменная + вторая переменная.
 *Подумать над полученным результатом.
 */
public class Ex5 {
    public static void main(String[] args) {
        char val1 = 1;
        int val2 = 1;
        System.out.println(val1 + val2);
    }
}
